import { defineTheme } from 'pinceau'

export default defineTheme({
  color: {
    primary: {
      // 50: "#a5b5de",
      // 100: "#889dd5",
      // 200: "#748dce",
      // 300: "#6480c9",
      // 400: "#5473c3",
      // 500: "#284fb4",
      // 600: "#1740ae",
      // 700: "#0b3caa",
      // 800: "#002ea6",
      // 900: "#001E6E"
      50: "#ffffff",
      100: "#d1fae5",
      200: "#a7f3d0",
      300: "#6ee7b7",
      400: "#35eb9a",
      500: "#42d392",
      600: "#42b883",
      700: "#33a06f",
      800: "#155f3e",
      900: "#022c22"
    }
  }
})

// 莫兰迪绿 #8ba583
// 莫兰迪粉 #cda59e
// 蒂芙尼蓝 #80d1c8
// 浅驼色 #ffd4a9
// 茶绿 #91b822
// 送花 #ffe76f
// 漆黑 #000010
// 橙 #ff770f
// 中国红 #d7000f
// 鱼肚白 #f1f2e5
// 克莱因蓝 #002ea6
// 拿坡里黄 #ffe78f
